Repository: nlm/sysassert
Catalog: sysassert/i18n/*/LC_MESSAGES/sysassert.po
Languages: fr

source: set the logging level
fr: selection le niveau de journalisation

source: colored output
fr: sortie colorée

source: validate a machine profile
fr: valider un profil de machine

source: machine profile to check
fr: profil de machine à valider

source: generate configuration from current hardware
fr: générer la configuration à partir du materiel actuel

source: plugins to generate config from
fr: plugins à utiliser pour la génération de configuration

source: check profile file validity
fr: verifier la validité d'un fichier de profil

source: list available plugins
fr: lister les plugins disponibles

source: list system tools dependencies
fr: lister les dépendences à des outils système

source: starting sysassert
fr: démarrage de sysassert

source: =========== BEGIN PROFILE {0} ==========
fr: =========== DEBUT DU PROFIL {0} ==========

source: error loading configuration
fr: erreur lors du chargement de la configuration

source: overall result: success ({0})
fr: résultat global : succès ({0})

source: overall result: failure
fr: résultat global : échec

source: available plugins: {0}
fr: plugins disponibles : {0}

source: checking {0}
fr: verification de {0}

source: file format is valid
fr: le format de fichier est valide

source: error loading configuration: {0}
fr: erreur lors du chargement de la configuration : {0}

source: internal error
fr: erreur interne

source: unknown dmi type
fr: type dmi inconnu

source: error in configuration: {0}
fr: erreur dans la configuration : {0}

source: config section: {0}
fr: section de configuration : {0}

source: plugin not found: {0}
fr: plugin non trouvé : {0}

source: configuring plugin: {0}
fr: configuration du plugin : {0}

source: ----- BEGIN {0} -----
fr: ----- DEBUT {0} -----

source: ----- END {0} -----
fr: ----- FIN {0} -----

source: generating with plugin: {0}
fr: generation avec le plugin : {0}

source: unknown plugin: {0}
fr: plugin inconnu : {0}

source: searching datasource "{0}"
fr: recherche de la source de données "{0}"

source: found datasource "{0}"
fr: source de données trouvée "{0}"

source: validating from "{0}/{1}" datasource (strict: {2})
fr: validation depuis la source de données "{0}/{1}" (strict : {2})

source: found matching {0} ({1})
fr: {0} correspondant trouvé ({1})

source: missing {0} ({1})
fr: {0} manquant ({1})

source: unwanted {0} ({1})
fr: {0} non désiré ({1})

source: wanted: {0}
fr: voulu: {0}

source: attr mismatch: {0} ({1} <=> {2})
fr: attribut ne correspondant pas : {0} ({1} <=> {2})

source: found match: {0}
fr: correspondance trouvée : {0}

source: device
fr: périphérique

source: processor
fr: processeur

source: memory device
fr: périphérique mémoire

source: memory
fr: mémoire

source: disk
fr: disque
